n = int(input())
dp = [[0]*10 for _ in range(n+1)]

for i in range(1,10):  # n = 1 일 때
    dp[1][i] = 1

for i in range(2, n+1): # n = 2 ...
    for j in range(10):
        if j == 0:
            dp[i][j] = dp[i-1][j+1]
        elif j == 9:
            dp[i][j] = dp[i-1][j-1]
        else:
            dp[i][j] = dp[i-1][j-1] + dp[i-1][j+1]

print(sum(dp[n])%1000000000)



#----------------
# n=2
# 0 0
# 1 1
# 2 2
# 3 3
# 4 4
# 5 5
# 6 6
# 7 7
# 8 8
# 9 9

# n = 1 일 때, 0은 0 [1-9] 1개씩
# -> 0  1  1  1  1  1  1  1  1  1
# n = 2 일 때, 1은 [0 2], 2는 [1 3], 3은 [2 4] .... 8은 [7 9], 9는 8
# -> 1  1  2  2  2  2  2  2  2  1
# n = 3 일 때,
# -> 1  3  3  4  4  4  4  4  3  2